gspiders/dto/json_path_design.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-06-27 周三 15:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>JSON PATH DESIN</title>
<meta name="generator" content="Org mode" />


</head>
<body>
<div id="content">
<h1 class="title">JSON PATH DESIN</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org42a137f">1. 设计思路</a>
<ul>
<li><a href="#orgf7176bb">1.1. 表达式构成</a></li>
<li><a href="#org6e5c3de">1.2. 选择器</a>
<ul>
<li><a href="#org0a93a2c">1.2.1. 单元素选择器</a></li>
<li><a href="#org4051770">1.2.2. 多元素选择器</a></li>
<li><a href="#org7ecf0c8">1.2.3. 返回下一级内容的选择器</a></li>
</ul>
</li>
<li><a href="#org57b452d">1.3. 过滤器</a></li>
<li><a href="#org3281ebe">1.4. 比较操作(目的是用于测试元素或子元素是否满足某些条件)</a>
<ul>
<li><a href="#orgaf2bcd3">1.4.1. 当前支持以下比较类型</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb2e588f">2. 样例</a>
<ul>
<li><a href="#org4ae73fa">2.1. 每次选择以/分割, 形式如下</a></li>
<li><a href="#orgdf08d58">2.2. 实例分析</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org42a137f" class="outline-2">
<h2 id="org42a137f"><span class="section-number-2">1</span> 设计思路</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgf7176bb" class="outline-3">
<h3 id="orgf7176bb"><span class="section-number-3">1.1</span> 表达式构成</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>"/[选择器 ? 过滤器]"  "/{选择器 ? 过滤器}"
<ol class="org-ol">
<li>{}表示 dict,  []表示 list</li>
<li>选择器、过滤器、比较器参考下述描述</li>
</ol></li>
<li>操作过程为
<ol class="org-ol">
<li>过滤(filter): 过滤 list 或 dict 里面的项，结果仍然是一个 dict 或一个 list</li>
<li>选择(choose): 选择 list 或 dict 中的元素，或多个元素返回取值内容作为结果</li>
</ol></li>
</ul>
</div>
</div>
<div id="outline-container-org6e5c3de" class="outline-3">
<h3 id="org6e5c3de"><span class="section-number-3">1.2</span> 选择器</h3>
<div class="outline-text-3" id="text-1-2">
<p>
选择器用于选择节点
</p>
</div>
<div id="outline-container-org0a93a2c" class="outline-4">
<h4 id="org0a93a2c"><span class="section-number-4">1.2.1</span> 单元素选择器</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>单一选择器执行选择操作后，返回对应的元素(相当于当前节点切换到下一层)</li>
<li>举例
<ul class="org-ul">
<li>/[1] 返回列表的第 2 个元素</li>
<li>/[-1] 返回列表的倒数第 1 个元素</li>
<li>/{key1} 返回字典 key1 对应的数据</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org4051770" class="outline-4">
<h4 id="org4051770"><span class="section-number-4">1.2.2</span> 多元素选择器</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li>批量选择器执行选择操作后，返回元素列表或字典(相当于 root 节点仍保留在当前层)</li>
<li>举例
<ul class="org-ul">
<li>/[1:-1] 返回列表的第 2 个到最后一个元素, 构成的新列表</li>
<li>/{~key1} 返回字典中除 key1 以外的其他所有数据, 结果仍然是字典</li>
<li>/{k1,k2,k3} 返回字典中 key1,key2,key3 组成的数据, 结果仍然是字典</li>
<li>/{~k1,k2,k3} 返回字典中除 k1,k2,k3 以外的其他数据, 结果仍然是字典</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org7ecf0c8" class="outline-4">
<h4 id="org7ecf0c8"><span class="section-number-4">1.2.3</span> 返回下一级内容的选择器</h4>
<div class="outline-text-4" id="text-1-2-3">
<ul class="org-ul">
<li>获取下一级内容(下一级内容只支持获取单属性)</li>
<li>举例
<ul class="org-ul">
<li>data = [Student1, Student2, Student3]   Student 结构为 {'name': xxx, 'sex': xxx, 'score': 80}</li>
<li>返回分数超过 80 分的所有学生(先过虑,再选择 name 属性), 则对应的选择器书写为  /[?@score&gt;=80]|[@name]</li>
<li>/[i:j@k1]  /{@k1@k13}</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org57b452d" class="outline-3">
<h3 id="org57b452d"><span class="section-number-3">1.3</span> 过滤器</h3>
<div class="outline-text-3" id="text-1-3">
<p>
相当于为 filter 函数设计的简写版 lambda 语法, 适用于 list 的元素以及 dict 的元素 
filter(list or dict, lambda<sub>expression</sub>, sequence))
</p>
<ul class="org-ul">
<li>过滤器有如下形式
<ul class="org-ul">
<li><b>?op value</b> 表示每个元素的取值满足 op 的比较条件(按值筛选)</li>
<li><b>?$ op value</b> 表示 dict 的 key 是否取值满足 op 的比较条件, 也就是按 key 筛选</li>
<li><b>?@k1 op value</b> 表示每个元素的 k1 属性是否满足 op 的比较条件(值是字典, 按字典里的 k1 对应的值筛选)
将遍历当前 list 或 dict, 对于每个 item, 找出满足 item.k1 op value 的 item, 组成新的 list 或 dict 返回</li>
<li><b>?@k1@k13 op value</b> 表示每个元素的 k1 属性下的 k13 属性值是否满足 op 的比较条件</li>
</ul></li>
<li>过滤器支持 pipline 操作, 使用符号 <b>|</b> 表示, pipeline 之间是 and 关系实际上|等同于/, 可视为语法糖, 仅仅是为了使数据层次性看起来清楚一些</li>
</ul>
</div>
</div>
<div id="outline-container-org3281ebe" class="outline-3">
<h3 id="org3281ebe"><span class="section-number-3">1.4</span> 比较操作(目的是用于测试元素或子元素是否满足某些条件)</h3>
<div class="outline-text-3" id="text-1-4">
<p>
比较操作一般是针对所选择的节点对应的 value 进行比较 如 list[0]的数值与指定值比较  dict1[key1]与指定值比较仅 $ op value 形式为与键值比较(当数据为 dict, 且无@相关 subkey 字段时方可生效)
</p>
</div>
<div id="outline-container-orgaf2bcd3" class="outline-4">
<h4 id="orgaf2bcd3"><span class="section-number-4">1.4.1</span> 当前支持以下比较类型</h4>
<div class="outline-text-4" id="text-1-4-1">
<ul class="org-ul">
<li>not rin
形式  selector not rin want<sub>value</sub>, 如果 want<sub>value</sub> not in selector 所选择的节点取值中, 返回 true, 否则返回 false</li>
<li>not in
形式  selector not in want<sub>value</sub>, 如果 selector 所选择的节点的值 not in want<sub>value</sub>, 返回 true, 否则返回 false</li>
<li>rin 类似 not rin, 只是逻辑变为 in</li>
<li>in 类似 not in, 只是逻辑变为 in</li>
<li>&gt;= 大于或等于</li>
<li>&lt;= 小于或等于</li>
<li>!= 不等于</li>
<li>= 等于</li>
<li>&gt; 大于</li>
<li>&lt; 小于</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb2e588f" class="outline-2">
<h2 id="orgb2e588f"><span class="section-number-2">2</span> 样例</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org4ae73fa" class="outline-3">
<h3 id="org4ae73fa"><span class="section-number-3">2.1</span> 每次选择以/分割, 形式如下</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>/{key1}		single return	过滤出当前字典中 key1 对应的数据(进入下一层)</li>
<li>/{~key1}		batch return	过滤当前字典中除 key1 以外的所有数据(保留在当前层)</li>
<li>/[1]			single return	过滤出列表第二个数据（进入下一层）</li>
<li>/[-1]			single return	过滤出列表倒数第一个数据（进入下一层）</li>
<li>/[:-1]			batch return	过滤出当前列表从 0 到倒数第二个数据(保留在当前层)</li>
</ul>
</div>
</div>
<div id="outline-container-orgdf08d58" class="outline-3">
<h3 id="orgdf08d58"><span class="section-number-3">2.2</span> 实例分析</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>'<i>{pageInfo}/{list}</i>[?@guideComment]|[?@brandName=农夫山泉]'
<ol class="org-ol">
<li>选取当前节点下的 pageInfo 节点内容(当前层为 dict)</li>
<li>接着选择下一层的 list 节点内容(当前层为 dict)</li>
<li>再接着选择下一层的所有 list, 过滤出其子节点 guideComment 不为空的元素(停留在 list 层)</li>
<li>接着继续在此 list 层操作, 过滤出其子节点 brandName 等于农夫山泉的所有数据(返回结果是个 list)</li>
</ol></li>
<li>'/{brandName}' 返回当前层中 brandName 节点的内容</li>
<li>'<i>{imageUrls}</i>[?$ rin http)]'
<ol class="org-ol">
<li>返回当前层下 imageUrls 节点内容</li>
<li>接着选择下一层所有节点,过滤出节点内容包含 http 的元素列表</li>
</ol></li>
<li>'/{ProductData}/{~id?@Id rin 478}'
<ol class="org-ol">
<li>返回当前层 ProductData 节点下的内容</li>
<li>过滤出除名字为~id 的其他所有节点内容, 然后进一步判断这些节点下的 Id 子节点内容, 过滤出内容包含 478 的所有节点</li>
</ol></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2018-06-27 周三 15:04</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
